Домашние инвестиции/src/DataProcessors/РаботаСАктивами_MOEX_Free/РаботаСАктивами_MOEX_Free.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСАктивами_MOEX_Free</name>
</mdclass:DataProcessor>

Домашние инвестиции/src/Catalogs/Активы/Активы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Активы</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктива</name>
    <type>
      <types>EnumRef.ВидыАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CFI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Домашние инвестиции/src/DataProcessors/РаботаСАктивами_MOEX_Free/ObjectModule.bsl
//*************
//Модуль обработки должен содержать Функции:
//	1  Функция ОписаниеМодуля() - возвращает структуру с описанием модуля 
//	2. Функция СписокАктивов(ВидАктива) - получает список активов с ресурса
//  3. Функция ИсторияЦен(Актив, НачалоПериода, КонецПериода, ТаймФрейм) - загружает график цен по активу за выбранный период
//	4. Функция Стакан(Актив) - получает стакан по активу
//	5. Функция НайтиАктив(КодАктива, ВидАктива) - поиск актива по коду
//
//*************

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем АдресРесурса;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ОписаниеМодуля() Экспорт
	
	ОписаниеМодуля = Новый Структура;
	ОписаниеМодуля.Вставить("Версия", "1.0");
	ОписаниеМодуля.Вставить("Заголовок", НСтр("ru = 'Загрузка активов из спискаи и цен  с сайта MOEX'"));
	ОписаниеМодуля.Вставить("Описание", НСтр("ru = 'Загружает список активов с сайта MOEX и цены по активам за выбранный период с сайта MOEX'"));
	ОписаниеМодуля.Вставить("ВидОбработки", "ДополнительныеМодуль");
	ОписаниеМодуля.Вставить("ТипМодуля", "РаботаСАктивами");
	ОписаниеМодуля.Вставить("ПоддерживаемяыеФункции",
		новый Структура("СписокАктивов, ИсторияЦен, Стакан", Истина, Истина, Истина));
	
	Возврат ОписаниеМодуля;

КонецФункции

Функция СписокАктивов(ВидАктива) Экспорт

	// Проверяем, что передан справочник с нужными реквизитами
	Если ТипЗнч(ВидАктива) <> Тип("СправочникСсылка.ВидыАктивов") Тогда
		ВызватьИсключение "Неверный тип параметра. Ожидается ссылка на справочник 'ВидыАктивов'";
	КонецЕсли;
	
	// Получаем данные для запроса из справочника
	БлокMOEX  = ВидАктива.БлокMOEX;
	РынокMOEX = ВидАктива.РынокMOEX;
	
	Если ПустаяСтрока(БлокMOEX) Или ПустаяСтрока(РынокMOEX) Тогда
		ВызватьИсключение "Для вида актива не указан Блок MOEX или Рынок MOEX";
	КонецЕсли;
	
	// Формируем URL для запроса к API MOEX
	// Указываем нужные поля: SECID (тикер), NAME (полное наим.), SHORTNAME (краткое наим.), ISIN, FACEVALUE (номинал)
	АдресЗапроса = СтрШаблон(
		"https://iss.moex.com/iss/engines/%1/markets/%2/securities.json?"
		+ "iss.meta=off&iss.only=securities&"
		+ "securities.columns=SECID,NAME,SHORTNAME,ISIN,FACEVALUE",
		БлокMOEX,
		РынокMOEX
	);
	
	// Создаем HTTP-соединение и запрос
	Соединение = Новый HTTPСоединение(АдресРесурса, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	HTTPRequest = Новый HTTPЗапрос(АдресЗапроса);
	
	РезультатЗапроса = Новый Массив;
	Попытка
		// Выполняем запрос
		HTTPОтвет = Соединение.Получить(HTTPRequest);
		
		// Читаем тело ответа в кодировке UTF-8
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		
		// Парсим JSON
		ДанныеJSON = Неопределено;
		ПрочитатьJSON(ДанныеJSON, ТелоОтвета);
		
		ИмяБлока = "securities";
		
		// Проверяем структуру ответа
		Если ДанныеJSON = Неопределено Или Не ДанныеJSON.Свойство(ИмяБлока) Тогда
			ВызватьИсключение "Неверный формат ответа от сервера MOEX. Отсутствует блок 'securities'.";
		КонецЕсли;
		
		БлокСекьюритис = ДанныеJSON[ИмяБлока];
		
		Если БлокСекьюритис.Количество() = 0 Тогда
			Возврат РезультатЗапроса; // Если данных нет, возвращаем пустой массив
		КонецЕсли;
		
		// Получаем заголовки (названия колонок)
		Колонки				= БлокСекьюритис[0]["columns"];
		ИндексТикера 		= Колонки.Найти("SECID");
		ИндексПолногоНаименования  = Колонки.Найти("NAME");
		ИндексКраткогоНаименования = Колонки.Найти("SHORTNAME");
		ИндексISIN 			= Колонки.Найти("ISIN");
		ИндексНоминала 		= Колонки.Найти("FACEVALUE");
		
		// Обрабатываем строки с данными
		Для Каждого СтрокаДанных Из БлокСекьюритис[0]["data"] Цикл
			
			// Создаем структуру для возврата
			СтруктураАктива = Новый Структура;
			СтруктураАктива.Вставить("Наименование", СтрокаДанных[ИндексКраткогоНаименования]);
			СтруктураАктива.Вставить("ПолноеНаименование", 	СтрокаДанных[ИндексПолногоНаименования]);
			СтруктураАктива.Вставить("Тикер", 				СтрокаДанных[ИндексТикера]);
			СтруктураАктива.Вставить("ISIN", 				СтрокаДанных[ИндексISIN]);
			
			// Номинал может быть не у всех активов (например, у ETF), поэтому делаем проверку
			Если ЗначениеЗаполнено(СтрокаДанных[ИндексНоминала]) Тогда
				Номинал = Число(СтрокаДанных[ИндексНоминала]);
			Иначе
				Номинал = 0;
			КонецЕсли;
			СтруктураАктива.Вставить("НоминальнаяСтоимость", Номинал);
			
			РезультатЗапроса.Добавить(СтруктураАктива);
			
		КонецЦикла;
		
	Исключение
		// Логируем ошибку и/или вызываем исключение для пользователя
		ЗаписьЖурналаРегистрации("ПолучениеДанныхMOEX", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при запросе к API MOEX: " + ОписаниеОшибки());
		ВызватьИсключение "Не удалось получить данные от MOEX. " + СокрЛП(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат РезультатЗапроса;

КонецФункции



// Функция является АСИНХРОННОЙ, так как использует оператор "Подождать".
// Вызывать ее можно только из других асинхронных процедур/функций.
Асинх Функция СписокАктивовПоВсемВидам(МассивВидовАктивов) Экспорт
	
	// Проверяем, что передан массив
	Если ТипЗнч(МассивВидовАктивов) <> Тип("Массив") Тогда
		ВызватьИсключение "Неверный тип параметра. Ожидается массив.";
	КонецЕсли;
	
	Если МассивВидовАктивов.Количество() = 0 Тогда
		Возврат Новый Массив; // Возвращаем пустой результат, если на входе пусто
	КонецЕсли;
	
	// Массив для хранения асинхронных задач и контекстной информации
	Задачи = Новый Массив;
	// Адрес ресурса для HTTPСоединения
	АдресРесурса = "iss.moex.com";
	
	// 1. Подготовка и запуск всех запросов асинхронно
	Для Каждого ВидАктива Из МассивВидовАктивов Цикл
		
		// Проверяем тип элемента массива
		Если ТипЗнч(ВидАктива) <> Тип("СправочникСсылка.ВидыАктивов") Тогда
			ВызватьИсключение "Неверный тип элемента в массиве. Ожидается ссылка на справочник 'ВидыАктивов'.";
		КонецЕсли;
		
		БлокMOEX  = ВидАктива.БлокMOEX;
		РынокMOEX = ВидАктива.РынокMOEX;
		
		Если ПустаяСтрока(БлокMOEX) Или ПустаяСтрока(РынокMOEX) Тогда
			ВызватьИсключение "Для одного из видов активов не указан Блок MOEX или Рынок MOEX.";
		КонецЕсли;
		
		АдресЗапроса = СтрШаблон(
			"/iss/engines/%1/markets/%2/securities.json?"
			+ "iss.meta=off&iss.only=securities&"
			+ "securities.columns=SECID,NAME,SHORTNAME,ISIN,FACEVALUE",
			БлокMOEX,
			РынокMOEX
		);
		
		Соединение = Новый HTTPСоединение(АдресРесурса, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		HTTPRequest = Новый HTTPЗапрос(АдресЗапроса);
		
		// Запоминаем вид актива, чтобы потом знать, для какого запроса пришёл результат
		КонтекстЗадачи = Новый Структура("ВидАктива", ВидАктива);
		
		// Запускаем асинхронный запрос
		АсинхронныйHTTPОтвет = Соединение.ПолучитьАсинхр(HTTPRequest, КонтекстЗадачи);
		
		Задачи.Добавить(АсинхронныйHTTPОтвет);
		
	КонецЦикла;
	
	// 2. Ожидание завершения всех запросов и обработка результатов
	ОбщийРезультат = Новый Массив;
	
	// Ждем, пока все задачи не будут выполнены (или произойдет ошибка)
	Подождать(Задачи);
	
	Для Каждого Задача Из Задачи Цикл
		
		РезультатЗапроса = Новый Массив; // Результат для одного конкретного запроса
		
		Попытка
			
			// Получаем результат выполнения асинхронной задачи
			HTTPОтвет = Задача.ПолучитьРезультат();
			
			// Читаем тело ответа
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
			
			// Парсим JSON
			ДанныеJSON = Неопределено;
			ПрочитатьJSON(ДанныеJSON, ТелоОтвета);
			
			ИмяБлока = "securities";
			
			// Проверяем структуру ответа
			Если ДанныеJSON = Неопределено Или Не ДанныеJSON.Свойство(ИмяБлока) Тогда
				// Логируем проблему для конкретного запроса, но не прерываем всю обработку
				ВидАктива = Задача.Контекст.ВидАктива;
				ЗаписьЖурналаРегистрации("ПолучениеДанныхMOEX", УровеньЖурналаРегистрации.Предупреждение, , ,
					СтрШаблон("Неверный формат ответа от сервера MOEX для '%1'. Отсутствует блок 'securities'.", ВидАктива));
				Продолжить; // Переходим к следующей задаче
			КонецЕсли;
			
			БлокСекьюритис = ДанныеJSON[ИмяБлока];
			
			Если БлокСекьюритис.Количество() = 0 Или БлокСекьюритис[0]["data"].Количество() = 0 Тогда
				Продолжить; // Данных нет, добавлять нечего
			КонецЕсли;
			
			// Получаем индексы колонок (эта часть не изменилась)
			Колонки				= БлокСекьюритис[0]["columns"];
			ИндексТикера 		= Колонки.Найти("SECID");
			ИндексПолногоНаименования  = Колонки.Найти("NAME");
			ИндексКраткогоНаименования = Колонки.Найти("SHORTNAME");
			ИндексISIN 			= Колонки.Найти("ISIN");
			ИндексНоминала 		= Колонки.Найти("FACEVALUE");
			
			// Обрабатываем строки с данными (эта часть не изменилась)
			Для Каждого СтрокаДанных Из БлокСекьюритис[0]["data"] Цикл
				
				СтруктураАктива = Новый Структура;
				СтруктураАктива.Вставить("Наименование", 		СтрокаДанных[ИндексКраткогоНаименования]);
				СтруктураАктива.Вставить("ПолноеНаименование", СтрокаДанных[ИндексПолногоНаименования]);
				СтруктураАктива.Вставить("Тикер", 				СтрокаДанных[ИндексТикера]);
				СтруктураАктива.Вставить("ISIN", 				СтрокаДанных[ИндексISIN]);
				
				// Номинал может быть не у всех активов
				Если ЗначениеЗаполнено(СтрокаДанных[ИндексНоминала]) Тогда
					Номинал = Число(СтрокаДанных[ИндексНоминала]);
				Иначе
					Номинал = 0;
				КонецЕсли;
				СтруктураАктива.Вставить("НоминальнаяСтоимость", Номинал);
				
				РезультатЗапроса.Добавить(СтруктураАктива);
				
			КонецЦикла;
			
			// Добавляем результат текущего запроса в общий массив
			ОбщийРезультат.Добавить(РезультатЗапроса);
			
		Исключение
			// Логируем ошибку для конкретного запроса
			ВидАктива = Задача.Контекст.ВидАктива;
			ЗаписьЖурналаРегистрации("ПолучениеДанныхMOEX", УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("Ошибка при запросе к API MOEX для '%1': %2", ВидАктива, ОписаниеОшибки()));
			// Можно также решить, вызывать ли исключение здесь.
			// В данном случае мы продолжаем обработку, чтобы сбой одного запроса не обрушил все.
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ОбщийРезультат;
	
КонецФункции



// Основная функция
Функция НайтиАктивы(СтрокаПоиска, ИскатьВСервисе = Ложь) Экспорт
	
	Результат = Новый Массив;
	СписокНайденныхТикеров = Новый СписокЗначений; // Для отслеживания уникальности
	
	СтрокаПоиска = СокрЛП(НСтр(СтрокаПоиска)); // Приводим к стандартному виду
	
	// 1. ИЩЕМ В ЛОКАЛЬНОМ СПРАВОЧНИКЕ
	НайденныеВСправочнике = НайтиАктивыВСправочнике(СтрокаПоиска);
	Для Каждого СтруктураАктива Из НайденныеВСправочнике Цикл
		Результат.Добавить(СтруктураАктива);
		СписокНайденныхТикеров.Добавить(СтруктураАктива.Тикер);
	КонецЦикла;
	
	// 2. ИЩЕМ В API MOEX, ЕСЛИ НАДО
	Если ИскатьВСервисе Тогда
		НайденныеВСервисе = НайтиАктивыВMOEX(СтрокаПоиска);
		
		Для Каждого ДанныеAPI Из НайденныеВСервисе Цикл
			
			// Проверяем, нет ли уже такого актива (по уникальному тикеру) в результатах поиска
			Если СписокНайденныхТикеров.НайтиЗначение(ДанныеAPI.Тикер) = Неопределено Тогда
				
				// Актив найден в API, но нет в справочнике. Добавляем в результат и в справочник.
				СтруктураНовогоАктива = НайтиИлиСоздатьАктивВСправочнике(ДанныеAPI);
				Если СтруктураНовогоАктива <> Неопределено Тогда
					Результат.Добавить(СтруктураНовогоАктива);
					СписокНайденныхТикеров.Добавить(СтруктураНовогоАктива.Тикер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// --- Вспомогательные функции (обновленные) ---

Функция НайтиАктивыВСправочнике(СтрокаПоиска)
	
	Результат = Новый Массив;
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Используем запрос с объединением, чтобы получить все данные за одно обращение к БД
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Активы.Ссылка,
		|	Активы.Наименование КАК КраткоеНаименование,
		|	Активы.ПолноеНаименование,
		|	Активы.ISIN,
		|	Активы.Тикер,
		|	Активы.Номинал
		|ИЗ
		|	Справочник.Активы КАК Активы
		|ГДЕ
		|	Активы.Тикер ПОДОБНО &СтрокаПоиска
		|	ИЛИ Активы.ISIN ПОДОБНО &СтрокаПоиска
		|	ИЛИ Активы.Наименование ПОДОБНО &СтрокаПоиска";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураРезультата.Вставить("КраткоеНаименование", Выборка.КраткоеНаименование);
		СтруктураРезультата.Вставить("ПолноеНаименование", Выборка.ПолноеНаименование);
		СтруктураРезультата.Вставить("ISIN", Выборка.ISIN);
		СтруктураРезультата.Вставить("Тикер", Выборка.Тикер);
		СтруктураРезультата.Вставить("Номинал", Выборка.Номинал);
		Результат.Добавить(СтруктураРезультата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция НайтиАктивыВMOEX остается без изменений
Функция НайтиАктивыВMOEX(СтрокаПоиска)
	
	Результат = Новый Массив;
	
	РынкиДляПоиска = Новый Массив;
	РынкиДляПоиска.Добавить("shares");
	РынкиДляПоиска.Добавить("bonds");
	
	Для Каждого Рынок Из РынкиДляПоиска Цикл
		
		АдресЗапроса = СтрШаблон(
			"https://iss.moex.com/iss/securities.json?q=%1&is_trading=1&group_by=group&limit=100&engine=stock&market=%2",
			СтрокаПоиска,
			Рынок
		);
		
		Соединение = Новый HTTPСоединение(АдресРесурса, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		HTTPRequest = Новый HTTPЗапрос(АдресЗапроса);
		
		Попытка
			HTTPОтвет = Соединение.Получить(HTTPRequest);
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
			
			ДанныеJSON = Неопределено;
			ПрочитатьJSON(ДанныеJSON, ТелоОтвета);
			
			Если ДанныеJSON = Неопределено Или Не ДанныеJSON.Свойство("securities") Тогда
				Продолжить;
			КонецЕсли;
			
			Блоки = ДанныеJSON["securities"];
			
			Для Каждого Ключ Из Блоки.Ключи() Цикл
				Если ТипЗнч(Блоки[Ключ]) = Тип("Структура") И Блоки[Ключ].Свойство("data") Тогда
					Колонки = Блоки[Ключ]["columns"];
					СтрокиДанных = Блоки[Ключ]["data"];
					
					ИндексТикера 		= Колонки.Найти("secid");
					ИндексНаименования  = Колонки.Найти("name");
					ИндексКраткогоНаименования = Колонки.Найти("shortname");
					ИндексISIN 			= Колонки.Найти("isin");
					ИндексНоминала 		= Колонки.Найти("facevalue");
					
					Для Каждого СтрокаДанных Из СтрокиДанных Цикл
						ДанныеАктива = Новый Структура;
						ДанныеАктива.Вставить("Тикер", СтрокаДанных[ИндексТикера]);
						ДанныеАктива.Вставить("ПолноеНаименование", СтрокаДанных[ИндексНаименования]);
						ДанныеАктива.Вставить("КраткоеНаименование", СтрокаДанных[ИндексКраткогоНаименования]);
						ДанныеАктива.Вставить("ISIN", ?(ЗначениеЗаполнено(СтрокаДанных[ИндексISIN]), СтрокаДанных[ИндексISIN], ""));
						
						Номинал = 0;
						Если ИндексНоминала <> Неопределено И ЗначениеЗаполнено(СтрокаДанных[ИндексНоминала]) Тогда
							Номинал = Число(СтрокаДанных[ИндексНоминала]);
						КонецЕсли;
						ДанныеАктива.Вставить("Номинал", Номинал);
						
						Результат.Добавить(ДанныеАктива);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			ЗаписьЖурналаРегистрации("ПоискАктивовMOEX", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при поиске в API: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиИлиСоздатьАктивВСправочнике(ДанныеАктива)
	
	СсылкаНаАктив = Справочники.Активы.НайтиПоРеквизиту("Тикер", ДанныеАктива.Тикер);
	
	ОбъектАктива = ?(СсылкаНаАктив.Пустая(), Справочники.Активы.СоздатьЭлемент(), СсылкаНаАктив.ПолучитьОбъект());
	
	// Заполняем/обновляем данные объекта
	ОбъектАктива.Наименование = ДанныеАктива.КраткоеНаименование;
	ОбъектАктива.ПолноеНаименование = ДанныеАктива.ПолноеНаименование;
	ОбъектАктива.ISIN = ДанныеАктива.ISIN;
	ОбъектАктива.Тикер = ДанныеАктива.Тикер;
	ОбъектАктива.Номинал = ДанныеАктива.Номинал;
	
	Попытка
		ОбъектАктива.Записать();
		
		// Возвращаем готовую структуру, чтобы не делать повторный запрос к данным
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("Ссылка", ОбъектАктива.Ссылка);
		СтруктураРезультата.Вставить("КраткоеНаименование", ОбъектАктива.Наименование);
		СтруктураРезультата.Вставить("ПолноеНаименование", ОбъектАктива.ПолноеНаименование);
		СтруктураРезультата.Вставить("ISIN", ОбъектАктива.ISIN);
		СтруктураРезультата.Вставить("Тикер", ОбъектАктива.Тикер);
		СтруктураРезультата.Вставить("Номинал", ОбъектАктива.Номинал);
		
		Возврат СтруктураРезультата;
		
	Исключение
		ЗаписьЖурналаРегистрации("СозданиеИлиОбновлениеАктива", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось записать актив " + ДанныеАктива.Тикер + ": " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции




#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

АдресРесурса = "iss.moex.com";

#КонецОбласти

#КонецЕсли
